{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_2",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 18,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense10",
            "trainable": true,
            "batch_input_shape": [null, 18],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense11",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.05,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout7",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense12",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.05,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout8",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense13",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.05,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout9",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense14",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.05,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout10",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense15",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.05,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout11",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense16",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.05,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout12",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 36,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense17",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense18",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 2.0.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.0.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["./20210716-165130.weights.bin"],
      "weights": [
        {
          "name": "dense_Dense10/kernel",
          "shape": [18, 18],
          "dtype": "float32"
        },
        { "name": "dense_Dense10/bias", "shape": [18], "dtype": "float32" },
        {
          "name": "dense_Dense11/kernel",
          "shape": [18, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense11/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense12/kernel",
          "shape": [36, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense12/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense13/kernel",
          "shape": [36, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense13/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense14/kernel",
          "shape": [36, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense14/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense15/kernel",
          "shape": [36, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense15/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense16/kernel",
          "shape": [36, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense16/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense17/kernel",
          "shape": [36, 36],
          "dtype": "float32"
        },
        { "name": "dense_Dense17/bias", "shape": [36], "dtype": "float32" },
        {
          "name": "dense_Dense18/kernel",
          "shape": [36, 2],
          "dtype": "float32"
        },
        { "name": "dense_Dense18/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
